Section_4_Real_Workload_Validation/Experiment13/data/raw/case-C/sustained-ramp/trial_024/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 36.931ms, rate sampling interval: 82ms
  Thread calibration: mean lat.: 36.996ms, rate sampling interval: 83ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.67ms   18.36ms 231.68ms   95.13%
    Req/Sec   351.67     57.93     0.89k    89.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   32.46ms
 75.000%   34.94ms
 90.000%   40.99ms
 99.000%  151.93ms
 99.900%  201.98ms
 99.990%  215.68ms
 99.999%  222.34ms
100.000%  231.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      27.407     0.000000            1         1.00
      29.919     0.100000        12084         1.11
      30.591     0.200000        23906         1.25
      31.199     0.300000        36000         1.43
      31.791     0.400000        47660         1.67
      32.463     0.500000        59650         2.00
      32.831     0.550000        65667         2.22
      33.215     0.600000        71375         2.50
      33.695     0.650000        77624         2.86
      34.207     0.700000        83242         3.33
      34.943     0.750000        89370         4.00
      35.391     0.775000        92309         4.44
      35.935     0.800000        95206         5.00
      36.607     0.825000        98138         5.71
      37.535     0.850000       101118         6.67
      38.847     0.875000       104052         8.00
      39.807     0.887500       105548         8.89
      40.991     0.900000       107059        10.00
      42.655     0.912500       108524        11.43
      44.991     0.925000       110004        13.33
      48.607     0.937500       111479        16.00
      51.103     0.943750       112225        17.78
      54.335     0.950000       112971        20.00
      58.111     0.956250       113712        22.86
      62.911     0.962500       114452        26.67
      68.287     0.968750       115196        32.00
      72.127     0.971875       115570        35.56
      78.783     0.975000       115938        40.00
      88.383     0.978125       116310        45.71
     104.127     0.981250       116681        53.33
     121.215     0.984375       117054        64.00
     129.471     0.985938       117239        71.11
     138.751     0.987500       117425        80.00
     147.583     0.989062       117614        91.43
     154.367     0.990625       117797       106.67
     161.535     0.992188       117982       128.00
     165.119     0.992969       118075       142.22
     168.191     0.993750       118168       160.00
     171.903     0.994531       118261       182.86
     175.999     0.995313       118354       213.33
     180.479     0.996094       118446       256.00
     183.423     0.996484       118494       284.44
     185.983     0.996875       118539       320.00
     188.543     0.997266       118586       365.71
     190.719     0.997656       118635       426.67
     193.663     0.998047       118681       512.00
     195.071     0.998242       118703       568.89
     196.863     0.998437       118725       640.00
     198.655     0.998633       118748       731.43
     200.447     0.998828       118772       853.33
     202.239     0.999023       118795      1024.00
     203.135     0.999121       118806      1137.78
     204.159     0.999219       118818      1280.00
     205.311     0.999316       118830      1462.86
     206.335     0.999414       118842      1706.67
     207.615     0.999512       118852      2048.00
     208.127     0.999561       118858      2275.56
     209.279     0.999609       118865      2560.00
     210.175     0.999658       118871      2925.71
     210.815     0.999707       118877      3413.33
     211.839     0.999756       118882      4096.00
     211.967     0.999780       118885      4551.11
     212.479     0.999805       118887      5120.00
     213.119     0.999829       118890      5851.43
     213.887     0.999854       118893      6826.67
     215.167     0.999878       118896      8192.00
     215.295     0.999890       118897      9102.22
     215.807     0.999902       118899     10240.00
     216.063     0.999915       118901     11702.86
     216.191     0.999927       118902     13653.33
     216.831     0.999939       118903     16384.00
     217.471     0.999945       118904     18204.44
     218.239     0.999951       118905     20480.00
     218.239     0.999957       118905     23405.71
     219.263     0.999963       118906     27306.67
     219.775     0.999969       118907     32768.00
     219.775     0.999973       118907     36408.89
     221.439     0.999976       118908     40960.00
     221.439     0.999979       118908     46811.43
     221.439     0.999982       118908     54613.33
     222.335     0.999985       118909     65536.00
     222.335     0.999986       118909     72817.78
     222.335     0.999988       118909     81920.00
     222.335     0.999989       118909     93622.86
     222.335     0.999991       118909    109226.67
     231.807     0.999992       118910    131072.00
     231.807     1.000000       118910          inf
#[Mean    =       36.671, StdDeviation   =       18.363]
#[Max     =      231.680, Total count    =       118910]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  125960 requests in 3.00m, 102.47MB read
Requests/sec:    699.79
Transfer/sec:    582.93KB